---
type: PipeScheduleType
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 3
tags: [revit-api, class]
---

# PipeScheduleType

`Autodesk.Revit.DB.Plumbing.PipeScheduleType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static PipeScheduleType Create ( Document doc , string name )` |
| Method | GetPipeScheduleId | 2017 | `public static ElementId GetPipeScheduleId ( Document doc , string name )` |
| Property | Parameter | — | `` |